{
  "site": {
    "owner": "Fatih Tatoğlu",
    "role": "Engineer & Writer",
    "quote": "\"Life goes on, have to grab one end of it.\""
  },
  "status": {
    "theme": "Theme:",
    "language": "Language:"
  },
  "menu": {
    "technical": "Technical Notes",
    "life": "Life & Learning",
    "about": "About",
    "contact": "Contact",
    "searchPlaceholder": "Search title, topic, tag…",
    "buttonLabel": "Open menu"
  },
  "content": {
    "heading": "Daily content notes",
    "actions": {
      "showMore": "Show extended content",
      "showLess": "Back to summary"
    },
    "sample": "This block is a short sample paragraph to demonstrate the bilingual page structure. Switch to Turkish and the translation will appear instantly.",
    "long": {
      "lead": "Daily observations and radar notes",
      "imageCaption": "Ideas captured during a quiet, early-morning writing session.",
      "imageAlt": "Minimal desk setup with a notebook and cup of coffee",
      "p1": "My productive rhythm balances short sprints with deep-thinking sessions. I research with a sharp morning mind and polish the prose toward evening.",
      "p2": "While refining design systems, I like weaving color theory together with a nostalgic terminal vibe, giving readers something both familiar and fresh.",
      "p3": "The cadence of writing shapes the flow of code. Just as paragraphs need breathing room, components deserve carefully crafted spacing.",
      "p4": "Creating bilingual content means going beyond literal translation and searching for conceptual counterparts so that meaning travels with context.",
      "p5": "Accessibility tools and minimal interface prototypes sit on my radar this week. Every discovery feels like opening a new page in a holographic notebook.",
      "p6": "Documenting experiences matters as much as sharing them. This long-form note becomes a memory marker that guides future projects."
    }
  },
  "footer": {
    "policies": {
      "cookies": "Cookie Policy",
      "disclaimer": "Disclaimer"
    },
    "social": {
      "rss": "RSS",
      "github": "GITHUB",
      "linkedin": "LINKEDIN"
    },
    "tags": {
      "frontend": "Frontend",
      "javascript": "JavaScript",
      "css": "CSS",
      "designSystems": "Design Systems",
      "webPerformance": "Web Performance",
      "accessibility": "Accessibility",
      "learningNotes": "Learning Notes",
      "productThinking": "Product Thinking",
      "writing": "Writing",
      "lifeLearning": "Life & Learning"
    },
    "tagline": "Every line starts with curiosity and ends with discipline."
  }
}
